{
  "backend/main.mo": "Main Motoko actor implementing a scaffolding rental management system with user profiles, customers, vendors, inventory, and rental orders, using role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting three authentication-related fixes in AuthGuard.tsx and LoginButton.tsx to handle initialization errors and improve error boundaries.",
  "frontend-file-summaries.txt": "Pre-existing summaries of all frontend TypeScript/TSX files covering components, hooks, pages, and utilities for the scaffolding rental management system.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes, including sidebar, chart, and UI component colors.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all application routes, ThemeProvider, AuthGuard wrapper, and Toaster for notifications.",
  "frontend/src/components/AuthGuard.tsx": "Authentication guard component that shows login UI for unauthenticated users with optional initialization error warnings, displays loading states, and triggers profile setup modal for new authenticated users.",
  "frontend/src/components/CustomerForm.tsx": "Form component for creating and editing customer records with validation for NPWP, email, phone, and credit limit fields using Indonesian labels.",
  "frontend/src/components/DataTable.tsx": "Generic reusable data table component with search, pagination, and customizable columns. Supports row click handlers and displays 10 items per page.",
  "frontend/src/components/InventoryForm.tsx": "Form component for creating/editing inventory items with validation for item ID, type, quantity, condition, location, and acquisition cost. Handles ItemType and ConditionStatus enums.",
  "frontend/src/components/Layout.tsx": "Main application layout with header, navigation menu, content area, and footer. Includes login button and caffeine.ai attribution.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple loading spinner component with customizable text using Lucide's Loader2 icon.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states. Clears query cache on logout.",
  "frontend/src/components/NavigationMenu.tsx": "Sidebar navigation menu with role-based access control, organized into Dashboard, Operasional, Keuangan, Perpajakan, and Pengaturan sections. Highlights active route.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup requiring name and email. Cannot be dismissed until completed.",
  "frontend/src/components/RentalOrderForm.tsx": "Form for creating/editing rental orders with customer selection, multiple item selection via checkboxes, date range validation, and status management. Fetches customers and inventory data.",
  "frontend/src/components/VendorForm.tsx": "React form component for creating and editing vendor records with validation for NPWP, email, phone, and payment terms fields. Handles form state, validation errors, and submission with support for both create and edit modes.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useAuthorization.ts": "Custom hooks for user authorization operations including fetching/saving user profiles, checking user roles and admin status, and assigning roles. Uses React Query for caching and the actor hook for backend communication.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and auth client lifecycle. Provides login, logout, and status tracking functionality throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on customers, vendors, and inventory items. Each entity has hooks for fetching lists and performing add, update, and delete mutations with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a professional business theme for both light and dark modes, including colors for UI components, charts, and sidebar. Includes print media styles for invoices and reports.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context. Renders the main App component with necessary providers.",
  "frontend/src/pages/Accounting.tsx": "Placeholder page component for the accounting module with a background image and informational message indicating that Chart of Accounts, Journal Entry, and General Ledger features are coming soon.",
  "frontend/src/pages/CustomerManagement.tsx": "Customer management page with CRUD operations for customers, displaying a data table with columns for company name, NPWP, contact person, phone, and credit limit. Includes modal forms for add/edit and confirmation dialogs for deletion.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page displaying KPI cards (total customers, inventory items, active orders, inventory value) and summary sections for inventory and orders. Features a hero image banner with scaffolding theme.",
  "frontend/src/pages/FinancialReports.tsx": "Placeholder page for financial reports module (profit/loss, balance sheet, cash flow) with a background image and message indicating the feature is coming soon.",
  "frontend/src/pages/InventoryManagement.tsx": "Inventory management page with CRUD operations for inventory items, displaying a data table with columns for item ID, type, quantity, condition (with badge styling), location, and acquisition cost. Includes modal forms and delete confirmations.",
  "frontend/src/pages/InvoiceManagement.tsx": "Placeholder page for invoice and payment management module with a message indicating the feature requires additional backend implementation.",
  "frontend/src/pages/RentalOrderManagement.tsx": "Rental order management page with CRUD operations for orders, displaying a data table with columns for order ID, customer, item count, start/end dates, and status (with badge styling). Includes modal forms and delete confirmations.",
  "frontend/src/pages/TaxCompliance.tsx": "Placeholder page for Indonesian tax compliance module (VAT 11%, income tax, e-Faktur) with a message indicating the feature requires additional backend implementation.",
  "frontend/src/pages/UserManagement.tsx": "User management page displaying the current user's profile information (name, email, role) with a note that full user management features (role assignment, approval workflow) are coming soon.",
  "frontend/src/pages/VendorManagement.tsx": "React page component for vendor CRUD operations with data table display, add/edit dialog form, delete confirmation, and toast notifications using custom hooks and UI components.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting currency (IDR), numbers, dates (Indonesian locale), and NPWP tax IDs with validation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/utils/validation.ts": "Validation functions for NPWP, email, phone numbers, positive numbers, and date ranges with error messages in Indonesian.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended typography, container queries, animations, and design tokens for a desktop-optimized UI.",
  "project_state.json": "Project metadata defining a comprehensive scaffolding rental management system with Indonesian tax compliance, blockchain backend, audit logging, and desktop-first architecture; currently has a loading loop issue on authentication page."
}