{
  "backend/main.mo": "Main Motoko actor implementing user profiles, customer management, vendor management, inventory tracking, rental orders, and role-based access control with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting implemented features for customer, vendor, inventory, rental order, and invoicing modules with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Summaries of all frontend TypeScript/React files including pages, components, hooks, and utilities for the scaffolding rental management system.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for all pages (dashboard, customers, vendors, inventory, rentals, invoices, tax, accounting, reports, users) wrapped in AuthGuard and ThemeProvider.",
  "frontend/src/components/AuthGuard.tsx": "Authentication wrapper component that checks Internet Identity login status and user profile completion, showing loading states and profile setup modal when needed.",
  "frontend/src/components/CustomerForm.tsx": "Form component for creating and editing customer records with validation for NPWP, email, phone, and credit limit fields using Indonesian labels.",
  "frontend/src/components/DataTable.tsx": "Generic reusable data table component with search, pagination, and optional row click handlers. Supports custom column rendering and displays 10 items per page.",
  "frontend/src/components/InventoryForm.tsx": "Form component for creating/editing inventory items with fields for itemId, itemType, quantity, condition, location, and acquisitionCost. Includes validation for required fields and positive numbers.",
  "frontend/src/components/Layout.tsx": "Main application layout wrapper with header (title and login button), navigation menu sidebar, main content area, and footer with copyright and caffeine.ai attribution.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple loading spinner component displaying an animated Loader2 icon with customizable text message.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component using Internet Identity that handles login/logout and clears query cache on logout. Shows loading state during authentication.",
  "frontend/src/components/NavigationMenu.tsx": "Sidebar navigation menu with role-based access control, organized into Dashboard, Operasional, Keuangan, Perpajakan, and Pengaturan sections. Highlights active route and supports nested menu items.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup requiring name and email input. Cannot be dismissed and saves profile data via mutation hook.",
  "frontend/src/components/RentalOrderForm.tsx": "Form component for creating/editing rental orders with customer selection, multiple item selection via checkboxes, date range, and status. Validates required fields, item selection, and date ranges.",
  "frontend/src/components/VendorForm.tsx": "React form component for creating and editing vendor records with validation for NPWP, email, phone, and other vendor details. Handles form state, validation errors, and submission with support for both create and update modes.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useAuthorization.ts": "Collection of React Query hooks for user authorization operations including fetching/saving user profiles, checking user roles, verifying admin status, and assigning roles. All hooks depend on the actor from useActor.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login, logout, and status tracking functionality throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Comprehensive collection of React Query hooks for CRUD operations on customers, vendors, inventory items, and rental orders. Each entity has corresponding get, add, update, and delete hooks that interact with the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a professional business theme for both light and dark modes, including colors for UI components, charts, and sidebar. Includes print media styles for invoices and reports.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context. Renders the main App component with all necessary providers.",
  "frontend/src/pages/Accounting.tsx": "Placeholder page component for the accounting module with a background image and informational message indicating that Chart of Accounts, Journal Entry, and General Ledger features are coming soon.",
  "frontend/src/pages/CustomerManagement.tsx": "Customer management page with CRUD operations for customers, displaying a data table with columns for company name, NPWP, contact person, phone, and credit limit. Includes add/edit dialog form and delete confirmation alert.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page displaying KPI cards (total customers, inventory items, active orders, inventory value) and summary sections for inventory and orders. Features a hero image banner with scaffolding background.",
  "frontend/src/pages/FinancialReports.tsx": "Placeholder page for financial reports (profit/loss, balance sheet, cash flow) with a background image and message indicating the module is coming soon.",
  "frontend/src/pages/InventoryManagement.tsx": "Inventory management page with CRUD operations for inventory items, displaying a data table with columns for item ID, type, quantity, condition (with badge), location, and acquisition cost. Includes add/edit dialog form and delete confirmation alert.",
  "frontend/src/pages/InvoiceManagement.tsx": "Placeholder page for invoice and payment management with a message indicating the module is coming soon and requires additional backend support.",
  "frontend/src/pages/RentalOrderManagement.tsx": "Rental order management page with CRUD operations for orders, displaying a data table with columns for order ID, customer, item count, start/end dates, and status (with badge). Includes add/edit dialog form and delete confirmation alert.",
  "frontend/src/pages/TaxCompliance.tsx": "Placeholder page for Indonesian tax compliance (VAT 11%, PPh 23, e-Faktur) with a message indicating the module is coming soon and requires additional backend support.",
  "frontend/src/pages/UserManagement.tsx": "User management page displaying the current user's profile (name, email, role) with a note that full user management features (role assignment, approval workflow) are coming soon.",
  "frontend/src/pages/VendorManagement.tsx": "React page component for vendor CRUD operations with data table display, add/edit dialog form, delete confirmation, and toast notifications using custom hooks and UI components.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting currency (IDR), numbers, dates (Indonesian locale), and NPWP tax IDs with validation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/utils/validation.ts": "Validation functions for NPWP, email, phone numbers, positive numbers, and date ranges with error messages in Indonesian.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended typography, container queries, animations, and sidebar theming support.",
  "project_state.json": "Project metadata defining a comprehensive scaffolding rental management system with Indonesian tax compliance, blockchain backend, audit logging, and existing features for customer/vendor/inventory/rental/invoicing/tax modules."
}